app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all(:order => "created_at desc")
---
SELECT * FROM "tweets" ORDER BY created_at desc

  def create
    @tweet = Tweet.new(params[:tweet])
    if @tweet.save
      redirect_to tweets_path
    else
      @tweets = Tweet.all(:order => "created_at desc")
---
INSERT INTO "tweets" ("created_at", "updated_at", "message", "user") VALUES('2010-04-10 04:53:19', '2010-04-10 04:53:19', 'lots', 'kev')
SELECT * FROM "tweets" ORDER BY created_at desc